{
    "GP01":[
        {
            "groupID":"GP01",
            "title": "Quantum Insection",
            "groupName": "めろんすし",
            "explain_short": "ソウルライク（高難易度ゲーム）とシューティングを合わせた「横スクロールソウルライクシューティング」",
            "groupMember": "岩上 恭久、澤田 結七",
            "explain_long": "ソウルライクとは、何度も倒されては挑戦してクリアするゲームのことをいいます。その要素をシューティングと組み合わせると面白くなるのではと考えました。しかし、あまり難しくしすぎると楽しめない人が多いと思ったので、様々な要素を入れて誰でもクリアできるようにしました。 シューティングとソウルライクをあまり知らない人でもやりやすくなっていると思います。",
            "prPoint": "横スクロールシューティングは今の時代、あまり人気ではないので雰囲気は現代のゲームっぽく、難易度は本来のシューティングらしい難しさを残しつつ、誰でもクリアできる要素を入れることで難易度の緩和を試みました。また、複数の武器を選べるようにし、自分のプレイスタイルに合わせることができるようにしました。",
            "youtubeURL": "https://www.youtube.com/embed/9fAThdeedAc?si=pLbwrvRaNkgT7ZBd",
            "memberNum": "G101"
        }
    ],
    "GP02":[
        {
            "groupID":"GP02",
            "title": "アニソンFIRST",
            "groupName": "アニソンFIRST製作委員会",
            "explain_short": "毎クールごとに出るアニメソングをまとめたサイト",
            "groupMember": "高橋 志穏",
            "explain_long": "今回制作した経緯としては自分がアニメソングが好きでよく聞いていたり調べたりしているのですがその際に調べるとなるとまず始めに作品の公式サイトにアクセスして、楽曲ページにアクセスしてそこから今度はyoutubeにアクセスして調べてとアクセスにかかる時間が長い場合や、読み方がわからない曲だったりアーティストさんがおられることが多いのでそこを一括で改善できたらいいなと思ったことが経緯となります。ターゲット層としては各自治体の調査結果などを見て10代から20代と仮定して制作しましたが世代関係なく楽しめるサイトになっているので安心して調べることができます。楽曲は埋め込み式となっているのでその場で聞けることもFASTの意味として成り立つと考えています。",
            "prPoint": "デザイン面ではシンプルかつ個性的な配色にしたことと2曲ずつ配置しているので横並びにしたところです。技術面では目次を開いたり閉じたりできるところと目次にどこからでもアクセスできるようにしました。努力点では一つ目は圧倒的文字量です2023年秋クールと冬クールということでアニメ数は約60作品で、曲数は約120曲となっていて各アニメ、楽曲ごとに詳細という形でアーティストさんの情報や作品情報を掲載させていただいていてそれを情報整理したりして時間がかかりました。",
            "youtubeURL": "https://www.youtube.com/embed/GiSjyYlI0jQ?si=7j_yD-eQAD54gC5J",
            "memberNum": "H111"
        }
    ],
    "GP03":[
        {
            "groupID":"GP03",
            "title": "VOCABOOM",
            "groupName": "ボカロ業界を盛り上げる会",
            "explain_short": "2023年にyoutubeで多く再生されたボカロ曲をランキング形式で紹介するウェブサイト。",
            "groupMember": "大関 恵太",
            "explain_long": "私が作成した作品は、VOCABOOM（2023年人気ボカロ曲紹介サイト）です。 この作品は、2023年に人気となったボカロ曲をランキング形式で紹介するサイトです。 このサイトの目的・メリットとしては主に二つあり、2023年の人気ボカロ曲を簡単に知ることができる点、 そして自身の作曲したボカロ曲も載せているので、それらを知ることができる点です。 ターゲット層はボカロ好きの方10代～20代のかたです。",
            "prPoint": "工夫した点として、直観的で見やすいシンプルなデザインを心掛けて制作しました。 こだわった点としては、ボタンにカーソルを合わせると色が変化したり、詳細ページにいくとサイトの色が変わったりするようにコーディングやデザインを工夫したことです。 また、youtubeの埋め込みコードを挿入することにより、サイト内での再生を可能にした点です。全体的なデザインで工夫した点は、シンプルなデザインのランキングサイトを作ることを心がけ、角を丸くしたり、使用色を統一することを意識して作成しました。",
            "youtubeURL": "https://www.youtube.com/embed/nQmniIUEApo?si=eqFO9Q1AsNE2jsMU",
            "memberNum": "H103"
        }
    ],
    "GP04":[
        {
            "groupID":"GP04",
            "title": "わたしのイラスト成長記録",
            "groupName": "かえる",
            "explain_short": "私が描いた主にイラスト作品を年代別に成長記録として見返せるWebサイトです。",
            "groupMember": "佐藤 彩香",
            "explain_long": "このサイトは、昔使っていたスケッチブックや授業で制作した作品、前に使っていたスマホに眠っているイラストなどを一度で見返したい！という理由で制作しました。また、自分がどのくらい成長しているかがすぐわかるため、モチベーションのアップに繋がったり、私が何が好きなのかが一目で分かるため、自己紹介の代わりとしても使えます。ぜひ皆さんも私のサイトに遊びに来てください。",
            "prPoint": "この作品のポイントは、イラストはもちろん、ロゴやアイコン、デザインからコーディングまで全て一人で行った独自性の高いWebサイトということです。また、TOPページでは今までに描いたイラストがスライドショーで流れたり、イラストを一覧できるページではふわっと画像が表示されるアニメーションをつけて、見た人を楽しませるサイトになるよう制作しました。",
            "youtubeURL": "https://www.youtube.com/embed/53fCFFQalDA?si=D18d8TRS_RTBT9V6",
            "memberNum": "H109"
        }
    ],
    "GP05":[
        {
            "groupID":"GP05",
            "title": "プロ野球ドラフトサイト",
            "groupName": "プロ野球ドラフターズ",
            "explain_short": "2023プロ野球ドラフトと2024の候補選手を紹介しているサイトです。",
            "groupMember": "小林 侑史",
            "explain_long": "こだわったところは、2023ドラフトの選手は球団ごとのカラーを背景にして紹介しています。選手ごとの紹介文や球団ごとの補強ポジションを自分の意見とファンの知り合いの意見を組み合わせて作成しているところです。さらに、選手個人個人のチャートがあったり来年の2024ドラフト選手の中で個人的におすすめの選手を高校生4人大学生4人に絞ってどのような選手なのか2023ドラフトの選手と同じようにどのような選手なのかを紹介しています。",
            "prPoint": "選手ごとの紹介文や球団ごとの補強ポジションを自分の意見とファンの知り合いの意見を組み合わせて作成しているところです。さらに、選手個人個人のチャートがあったり来年の2024ドラフト選手の中で個人的におすすめの選手を高校生4人大学生4人に絞ってどのような選手なのか2023ドラフトの選手と同じようにどのような選手なのかを紹介しています。",
            "youtubeURL": "https://www.youtube.com/embed/ROs7lmkykNg?si=Vs1YFWMibMAVfDGI",
            "memberNum": "H107"
        }
    ],
    "GP06":[
        {
            "groupID":"GP06",
            "title": "実家の和菓子屋サイト",
            "groupName": "和菓子屋",
            "explain_short": "実家が和菓子屋をやっているので作成しました。",
            "groupMember": "村上 魁",
            "explain_long": "この作品を作った経緯としては、親が店のwebサイトがないということだったので進級制作として作成しました。",
            "prPoint": "シンプルで商品が見やすいデザインにしました。またホームにグーグルマップを埋め込むことでどこに店があるかをわかりやすくしました。背景画像として和紙っぽい画像を作成しました。",
            "youtubeURL": "https://www.youtube.com/embed/0XtYmIcBXBk?si=Tx6kVbdsMJm8PcWR",
            "memberNum": "H121"
        }
    ],
    "GP07":[
        {
            "groupID":"GP07",
            "title": "あんすた！！楽曲紹介サイト",
            "groupName": "あんすた",
            "explain_short": "あんさんぶるスターズ!!というコンテンツのおすすめ曲を紹介するサイトです。",
            "groupMember": "加藤 桃香",
            "explain_long": "あんスタを始めたばかりでどの曲から聴けばいいか分からない新規の人に知ってもらうためにオススメの曲を紹介するサイトを作りました。",
            "prPoint": "ユニット検索で聴きたいユニットを検索するとそのユニットのおすすめの曲が表示されるところです。サイト全体はシンプルなデザインにし背景をあんスタのカラーの黄色と青の２色にしました。ロゴは楽曲を紹介するサイトなので音符メインのロゴにしました。",
            "youtubeURL": "https://www.youtube.com/embed/_4Wop7-O-N4?si=DvkIr4mnNxzXLjvm",
            "memberNum": "H105"
        }
    ],
    "GP08":[
        {
            "groupID":"GP08",
            "title": "LA LIGA",
            "groupName": "サッカーやろうぜ",
            "explain_short": "順位表と初心者のためにオススメのチームなどを紹介するwebサイトです。",
            "groupMember": "大友 陸久",
            "explain_long": "私は年中の頃からリオネル・メッシ選手が好きでずっとバルセロナのファンでした。今リオネル・メッシ選手はいませんが想い出があるチームなのでサッカー系にしようと思い、順位表などよく見るのでバルセロナが所属しているスペインリーグのラ・リーガのことについてや順位表のwebサイトを作ろうと思いました。",
            "prPoint": "一つ一つの区切りでグラデーションの線を入れました。オススメのチーム紹介では画像や色などを使い情報をわかりやすいようにしました。",
            "youtubeURL": "https://www.youtube.com/embed/dIuNGnZaako?si=NTkXC5gpCTcbceZO",
            "memberNum": "H104"
        }
    ],
    "GP09":[
        {
            "groupID":"GP09",
            "title": "加藤農園のサイト",
            "groupName": "浅安クリエイション",
            "explain_short": "浅田の祖父母が営んでいるいちご農園のサイトを制作しました。",
            "groupMember": "浅田 和輝、安部 虎太朗",
            "explain_long": "ターゲット層は地元の主婦さんを主にサイトデザインをしました。サイトのデザインコンセプトは「丸」x「和」x「赤」です。いちごの詳細ページが一番のこだわりポイントです。いちごの蔓と花はイラストレーターで自分たちで描きました。またボタンから飛べるページではいちごのより詳しい説明やそれぞれの種類の美味しい食べ方を載せています。いちごの花のあしらいでページの罫線を作ったり、サイト全体の写真は実際に加藤農園で撮影したものになっています。",
            "prPoint": "ターゲット層が主婦なので、可愛らしく、使いやすくデザインしました。 topページのメインビジュアルでは、いちごをイメージした赤い丸を多様し、可愛らしさを出し、ロゴでは、加藤農園の加の口のところをいちごに変え一目で「いちご」とわかるデザインにしました。 背景には古民家の土壁の様な模様を使い、温かさを作り、それだけではページが単調になってしまうのでメインビジュアルでも使ったいちごをイメージした赤い丸を使用し、鮮やかさを出しました。 また、いちごの紹介の欄では、祖父母はいちごの花にこだわりを持っており、章姫、やよい姫の名前の横に花を添えています。 また、いちごのつる、葉を付けることで彩りを加えました。",
            "youtubeURL": "https://www.youtube.com/embed/flisy1Hf3Lk?si=raijs1zMmm9rAp4L",
            "memberNum": "H101、H102"
        }
    ],
    "GP10":[
        {
            "groupID":"GP10",
            "title": "FSSS",
            "groupName": "チームFSSS",
            "explain_short": "フォントの検索機能、プレビュー、配布ページへのリンクを持った、フォント選びを支援するサイトです。",
            "groupMember": "八木元生、渡辺陽太",
            "explain_long": "八木（コーディング担当）：技術向上を最大の目標として、初めてReactを用いてサイト制作を行ったり、企画段階では実装ができるか分かっていなかった機能も取り入れる前提で進めるなど、多くの挑戦をしました。制作を終えて、成長を強く実感しています。 渡辺（デザイン担当）：信頼できるサイトであることを示すため、シンプルで淡々としたイメージでデザインしました。検索結果画面はPCのウィンドウを模しています。",
            "prPoint": "フォントのサイズ、色、サンプルテキスト、背景色を自由に設定できる高機能なフォントプレビューを持っているためそのフォントを実際に使用する場面に近い設定で調べることができ、これによってフォントをダウンロードしてから想像との齟齬に気づくような失敗を防ぎます。",
            "youtubeURL": "https://www.youtube.com/embed/akC7WHXNQMU?si=rFL9JWZ1-km13DfL",
            "memberNum": "H122、H123"
        }
    ],
    "GP11":[
        {
            "groupID":"GP11",
            "title": "米農家(鹿児島)のLPサイト",
            "groupName": "うめこんぶ",
            "explain_short": "鹿児島県にあるお米農家、中村さんが育てる「なつほのか」という商品の紹介ページ",
            "groupMember": "佐々木 茉優、松元 弓紗、渡辺 真衣",
            "explain_long": "私たちが制作しているサイトは、チームメンバーの知り合いが営んでいる鹿児島のお米農家「中村」のWebサイトです。鹿児島のなつほのかというお米を紹介しています。なつほのかを育てている場所の紹介やおすすめのメニュー、Q&Aページに加え、Storeページを作ることで普段食べない場所のお米を手軽に購入できるようなサイトにしました。",
            "prPoint": "ターゲットが主婦層なので、サイト自体をシンプルで柔らかいイメージにしました。また、若い人でも高齢者でも見やすいくすみ系の色合いにしたところはこだわりです。手書きの稲やお米、おにぎりをワンポイントとして入れたり、写真の角を丸くすることで、可愛さや、親しみやすさを出しました。",
            "youtubeURL": "https://www.youtube.com/embed/NliE7leyRy4?si=CL_jqQXO1ANCSn1o",
            "memberNum": "H108、H118、H124"
        }
    ],
    "GP12":[
        {
            "groupID":"GP12",
            "title": "骨董品店のホームページ",
            "groupName": "かふぇらて",
            "explain_short": "骨董品店のサイトをリニューアルしたサイトを制作しました。既存のサイトではスクロールするほどのページもなかったのですが、リニューアルしたことで、多くの情報を載せたサイトになりました。",
            "groupMember": "戸田 聖也、三井 泰地、西村 遼河",
            "explain_long": "進級制作を行う中でまずグループで作成するので自分だけのイメージや考えを メンバーに伝えることの大変さを感じました。その人が得意不得意がありそれを補ったりスキルを生かすことでスムーズに制作を行えたと思います。デザイン面ではロゴの制作やサイト全体のレイアウトなどを行いました。大変だったのはコーディングでメンバーがみんな苦手とする分野だったので時間が少しかかるました。",
            "prPoint": "サイトをスクロールすると要素が浮かび上がることです。リニューアル前のサイトでは動きがなく張り付いているだけでしたが、動きを付けることで閲覧時間を伸ばすことなどの効果が得られます。浮かび上がるだけでなく横へスライドするものも作成しました。ハンバーガーメニューでは全ての項目にリンクを飛ばせるよう設定してあります。",
            "youtubeURL": "https://www.youtube.com/embed/aZ7pkl9CHJ8?si=byg-cJVcF4mG59Cy",
            "memberNum": "H114、H115、H119"
        }
    ]
    ,
    "GP13":[
        {
            "groupID":"GP13",
            "title": "今日何食ベル",
            "groupName": "ヨビリン",
            "explain_short": "食事を気分で選んでくれるWebアプリケーションです。",
            "groupMember": "塚本 貴士、平塚 英太郎、田中 遼太郎",
            "explain_long": "今日の食事メニューに何を食べるかで悩んでしまう人へ向けたWebアプリケーションです。制作メンバーが日常で感じていた問題を解決するために企画しました。提示される質問に対してメニューの要素を答えることで、結果が表示されます。シェアや付近の店舗表示、リロール、前回の結果表示など、多くの機能を備えています。",
            "prPoint": "リロールや付近の店舗表示など、使用者に寄り添ったシステムを目指しました。デザインについては、温かみのある食卓をコンセプトにしました。食卓をモチーフに木目調の背景を、テキストやボタンカラーは温かみがあり、木目の背景と合う黄色や茶色を選択し、全体的に丸みのあるデザインにしました。プログラムについては、ライブラリやフレームワークを使用しない、ネイティブJSで制作されています。また、1つ1つのコードを簡略化できるよう、配列やjsonファイルを用いてページのメンテナンス性を高めています。",
            "youtubeURL": "https://www.youtube.com/embed/Lps2M9-ahWU?si=u_tIDr8-CsOAbPHY",
            "memberNum": "H112、H113、H117"
        }
    ],
    "GP14":[
        {
            "groupID":"GP14",
            "title": "東京ラーメンランキングサイト",
            "groupName": "春日部ボーイS",
            "explain_short": "東京のラーメンのランキングサイトを制作しました。東京のラーメンを主観で評価をしてランキングにしました。",
            "groupMember": "小菅柊斗、宮岡愛斗、周君宝",
            "explain_long": "ターゲット層は普段からラーメンをよく食べる方、東京へ観光に来て、お昼や夕食のお店を探している方です。 コンセプトはサイトを開いたらラーメンの評価基準を理解した上でランキング画面が表示されるようになっていてまた、明るいイメージ、高級感などを与えるようなサイトにしました。 ファーストビューではラーメン屋さんのイメージである毛質フォントを使用してインパクトのあるラーメンの画像をダイナミックに配置し、 背景は優しいイメージの木目のような背景にしました。",
            "prPoint": "高級感やラーメン屋のイメージである毛質フォントなどを使用しました。 順位、店名、商品の画像、値段、評価、評価詳細 アクセス、マップなどランキングサイトとして 必要最低限の情報はもちろん、お店のロゴや評価を星の数で決めるなど工夫しました。 評価の基準をホバーすると説明が出てくる工夫などもしました。",
            "youtubeURL": "https://www.youtube.com/embed/4UBBLiXaZAY?si=ZP3QFRQH5I01urRh",
            "memberNum": "H106、H110、H120"
        }
    ]
}


